rbarreiro/homebots/ESP32_CAM_Robot_Car/app_httpd.cpp
   httpd_uri_t stream_uri = {
        .uri       = "/stream",
        .method    = HTTP_GET,
        .handler   = stream_handler,
        .user_ctx  = NULL
    };
    
    Serial.printf("Starting web server on port: '%d'\n", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(camera_httpd, &index_uri);
        httpd_register_uri_handler(camera_httpd, &cmd_uri);
        httpd_register_uri_handler(camera_httpd, &status_uri);
        httpd_register_uri_handler(camera_httpd, &capture_uri);
    }

    config.server_port += 1;
    config.ctrl_port += 1;
    Serial.printf("Starting stream server on port: '%d'\n", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(stream_httpd, &stream_uri);
    }
}

unsigned int get_speed(unsigned int sp)
{
  return map(sp, 0, 100, 0, 255);
}

void robot_setup()
{
    // Pins for Motor Controller
    //pinMode(LEFT_M0,OUTPUT);
    //pinMode(LEFT_M1,OUTPUT);
    //pinMode(RIGHT_M0,OUTPUT);
    //pinMode(RIGHT_M1,OUTPUT);
    
    // Make sure we are stopped
    robot_stop();

    // Motor uses PWM Channel 8
    //ledcAttachPin(MTR_PWM, 8);
    //ledcAttachPin(MTR_PWMB, 9);
    //ledcSetup(8, 2000, 8);
    //ledcSetup(9, 2000, 8);      
    //ledcWrite(8, 130);
    //ledcWrite(9, 130);


  ledcSetup(3, 2000, 8); /* 2000 hz PWM, 8-bit resolution and range from 0 to 255 */
  ledcSetup(4, 2000, 8); /* 2000 hz PWM, 8-bit resolution and range from 0 to 255 */
  ledcSetup(5, 2000, 8); /* 2000 hz PWM, 8-bit resolution and range from 0 to 255 */
  ledcSetup(6, 2000, 8); /* 2000 hz PWM, 8-bit resolution and range from 0 to 255 */
  ledcAttachPin(RIGHT_M0, 3);
  ledcAttachPin(RIGHT_M1, 4);
  ledcAttachPin(LEFT_M0, 5);
  ledcAttachPin(LEFT_M1, 6);
  pinMode(33, OUTPUT);
    
}

// Motor Control Functions

void update_speed()
{  
    ledcWrite(motorPWMChannnel, get_speed(motor_speed));
    
}

void robot_stop()
{
//  digitalWrite(LEFT_M0,LOW);
//  digitalWrite(LEFT_M1,LOW);
//  digitalWrite(RIGHT_M0,LOW);
//  digitalWrite(RIGHT_M1,LOW);
  ledcWrite(3, 0);
  ledcWrite(4, 0);
  ledcWrite(5, 0);
  ledcWrite(6, 0);
}

void robot_fwd()
{
  ledcWrite(3, 0);
  ledcWrite(4, speed);
  ledcWrite(5, 0);
  ledcWrite(6, speed);
  
  
  //digitalWrite(LEFT_M0,HIGH);
  //digitalWrite(LEFT_M1,LOW);
  //digitalWrite(RIGHT_M0,HIGH);
  //digitalWrite(RIGHT_M1,LOW);
  move_interval=350;
  previous_time = millis();  
}

void robot_back()
{
  ledcWrite(3, speed);
  ledcWrite(4, 0);
  ledcWrite(5, speed);
  ledcWrite(6, 0);
  
  //digitalWrite(LEFT_M0,LOW);
  //digitalWrite(LEFT_M1,HIGH);
  //digitalWrite(RIGHT_M0,LOW);
  //digitalWrite(RIGHT_M1,HIGH);
  move_interval=350;
   previous_time = millis();  
}

void robot_right()
{
  ledcWrite(3, 0);
  ledcWrite(4, speed);
  ledcWrite(5, speed);
  ledcWrite(6, 0);
  
  //digitalWrite(LEFT_M0,LOW);
  //digitalWrite(LEFT_M1,HIGH);
  //digitalWrite(RIGHT_M0,HIGH);
  //digitalWrite(RIGHT_M1,LOW);
  move_interval=100;
   previous_time = millis();
}

void robot_left()
{
  ledcWrite(3, speed);
  ledcWrite(4, 0);
  ledcWrite(5, 0);
  ledcWrite(6, speed);
  //digitalWrite(LEFT_M0,HIGH);
  //digitalWrite(LEFT_M1,LOW);
  //digitalWrite(RIGHT_M0,LOW);
  //digitalWrite(RIGHT_M1,HIGH);
  move_interval=100;
   previous_time = millis();
}
